// pages/details/details.js
Page({

    /**
     * 页面的初始数据
     */
    data: {
        content1:"<img src='../image/en.png' style='width:100%;'><p>  穿越百年历史风云，一个真理昭示未来：没有中国共产党，就没有新中国，就没有中华民族伟大复兴。</p><p>  听党话坚定理想信念。理想指引人生方向，信念决定事业成败。只有坚定理想信念，心中有信仰，脚下有力量，只有理想信念坚定的人，才能始终不渝、百折不挠，不论风吹雨打，不怕千难万险，坚定不移为实现既定目标而奋斗。新时代广大的党员干部要树立对马克思主义的信仰、对中国特色社会主义的信念、对中华民族伟大复兴中国梦的信心，胸怀忧国忧民之心、爱国爱民之情，不断奉献祖国、奉献人民。尤其是要自觉树立和践行社会主义核心价值观，扣好“人生第一粒扣子”，在大是大非面前，守住“主心骨”，不人云亦云。同时，常怀感恩之心，感恩党和国家，感恩社会和人民，为实现中华民族伟大复兴而努力。</p><p>  感党恩创造美好生活。“没有共产党，就没有新中国!”这句响亮的歌词常常在我们耳边响起。是呀，在共产党成立以后，他们，帮助中国人民抵抗侵略者，为中国人民做出贡献，如果没有共产党,那么新中国会成立吗?不，不会。1921年7月 ,浙江嘉兴南湖的一艘红船上传出巨人的呐喊,犹如春雷唤醒了沉睡已久的东方雄狮,拔开了数百年来笼罩于千万仁人志士心头的迷雾，亮出了共产主义的伟大旗帜，点燃了神州大地上的星星革命之火。“党恩浩浩母情纯，镰锤淬火惊鬼神。风雨砺得筋骨壮，冲天一啸铸功臣。”这一首诗，道尽了广大人民群众对党团结和带领大家创造美好生活的感激。</p><p>  跟党走坚定行动步伐。真正的爱党和爱国不应该仅仅表现在漂亮的言辞中，而是应该表现在为祖国、为人民谋福利的行动中。我们广大的党员干部要树立正确的人生观价值观和伟大的理想信念，甘愿为人民奉献一切。我们广大的党员干部都应该有这样的一个理想信念：今天，我们为党骄傲!明天，让党为我们自豪!我们广大的党员干部要以强烈的责任感和高度的自觉性扎实工作，不忘初心为党的事业贡献智慧和力量。要做到不忘初心、继续前进，要不断坚持学习，坚持梦想、坚持实践。并将学习成果转化为提升党性修养、思想境界、道德水平的精神营养，保持对实现中华民族伟大复兴的清醒认知和执著追求。</p><p>  为实现中华民族伟大复兴的“集结号”已经吹响，我们广大的党员干部、人民群众要始终坚持听党话、感党恩、跟党走，各民族团结起来，梦想的实现将不再遥远。</p>"

    },

    /**
     * 生命周期函数--监听页面加载
     */
    onLoad(params) {
        var newsId=params.newsId;
        console.log("传递过来的新闻id为：" + newsId)

    },

    /**
     * 生命周期函数--监听页面初次渲染完成
     */
    onReady() {

    },

    /**
     * 生命周期函数--监听页面显示
     */
    onShow() {

    },

    /**
     * 生命周期函数--监听页面隐藏
     */
    onHide() {

    },

    /**
     * 生命周期函数--监听页面卸载
     */
    onUnload() {

    },

    /**
     * 页面相关事件处理函数--监听用户下拉动作
     */
    onPullDownRefresh() {

    },

    /**
     * 页面上拉触底事件的处理函数
     */
    onReachBottom() {

    },

    /**
     * 用户点击右上角分享
     */
    onShareAppMessage() {

    }
})