// pages/things/things.js
Page({

    /**
     * 页面的初始数据
     */
    data: {
        content1:"<p>  新华社北京7月1日电 百年征程波澜壮阔，百年初心历久弥坚。7月1日上午，庆祝中国共产党成立100周年大会在北京天安门广场隆重举行，各界代表7万余人以盛大仪式欢庆中国共产党百年华诞。中共中央总书记、国家主席、中央军委主席习近平发表重要讲话。他强调，过去一百年，中国共产党向人民、向历史交出了一份优异的答卷。现在，中国共产党团结带领中国人民又踏上了实现第二个百年奋斗目标新的赶考之路。中国共产党立志于中华民族千秋伟业，百年恰是风华正茂。回首过去，展望未来，有中国共产党的坚强领导，有全国各族人民的紧密团结，全面建成社会主义现代化强国的目标一定能够实现，中华民族伟大复兴的中国梦一定能够实现。</p><img src='/pages/tos/images/1.jpg' style='width:100%;'><p>  习近平代表党和人民庄严宣告，经过全党全国各族人民持续奋斗，我们实现了第一个百年奋斗目标，在中华大地上全面建成了小康社会，历史性地解决了绝对贫困问题，正在意气风发向着全面建成社会主义现代化强国的第二个百年奋斗目标迈进。这是中华民族的伟大光荣，这是中国人民的伟大光荣，这是中国共产党的伟大光荣。</p><p>  中共中央政治局常委李克强主持庆祝大会。中共中央政治局常委栗战书、汪洋、王沪宁、赵乐际、韩正，国家副主席王岐山出席。</p></p><img src='/pages/tos/images/2.jpg' style='width:100%;'><p><p>  神州大地欣欣向荣、气象万千，首都北京花团锦簇、旌旗飘扬。在伟大的中国共产党领导下，近代以后久经磨难的中华民族迎来了从站起来、富起来到强起来的伟大飞跃，14亿多中国人民正意气风发走在中国特色社会主义新时代的壮丽征程上。</p><p>  习近平强调，过去一百年，中国共产党向人民、向历史交出了一份优异的答卷。现在，中国共产党团结带领中国人民又踏上了实现第二个百年奋斗目标新的赶考之路。习近平代表党中央号召全体中国共产党员，牢记初心使命，坚定理想信念，践行党的宗旨，永远保持同人民群众的血肉联系，始终同人民想在一起、干在一起，风雨同舟、同甘共苦，继续为实现人民对美好生活的向往不懈努力，努力为党和人民争取更大光荣。</p><p>  习近平讲话结束时，全场起立，现场响起长时间热烈掌声。</p><p>  大会在雄壮的国际歌声中结束。</p>"

    },

    /**
     * 生命周期函数--监听页面加载
     */
    onLoad(params) {
        var newsId=params.newsId;
        console.log("传递过来的新闻id为：" + newsId)

    },

    /**
     * 生命周期函数--监听页面初次渲染完成
     */
    onReady() {

    },

    /**
     * 生命周期函数--监听页面显示
     */
    onShow() {

    },

    /**
     * 生命周期函数--监听页面隐藏
     */
    onHide() {

    },

    /**
     * 生命周期函数--监听页面卸载
     */
    onUnload() {

    },

    /**
     * 页面相关事件处理函数--监听用户下拉动作
     */
    onPullDownRefresh() {

    },

    /**
     * 页面上拉触底事件的处理函数
     */
    onReachBottom() {

    },

    /**
     * 用户点击右上角分享
     */
    onShareAppMessage() {

    }
})